; domain
(define (domain logistics)
  (:requirements :strips :typing)
  (:types city location physobj vehicle package airport)
  (:predicates
    (loc ?l - location ?c - city)
    (at ?x - physobj ?l - location)
    (in ?p - package ?v - vehicle)
  )

  (:action load
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (at ?p ?l) (at ?v ?l))
    :effect (and (not (at ?p ?l)) (in ?p ?v))
  )

  (:action unload
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (in ?p ?v) (at ?v ?l))
    :effect (and (not (in ?p ?v)) (at ?p ?l))
  )

  (:action drive
    :parameters (?v - vehicle ?from - location ?to - location ?c - city)
    :precondition (and (at ?v ?from) (loc ?from ?c) (loc ?to ?c))
    :effect (and (not (at ?v ?from)) (at ?v ?to))
  )

  (:action fly
    :parameters (?v - vehicle ?from - location ?to - location)
    :precondition (at ?v ?from)
    :effect (and (not (at ?v ?from)) (at ?v ?to))
  )
)

; problem
(define (problem logistics-4)
  (:domain logistics)
  (:objects
    pkg1 pkg2 - object
    truck1 truck2 - truck
    plane1 - airplane
    loc1 loc2 loc3 - location
    airport1 airport2 - airport
    city1 city2 city3 - city
  )
  (:init
    ; City 1 locations
    (loc loc1 city1)
    (loc airport1 city1)
    
    ; City 2 locations
    (loc loc2 city2)
    (loc airport2 city2)
    
    ; City 3 locations (only needs airport since we're delivering to loc3)
    (loc loc3 city3)
    (loc airport2 city3)  ; Sharing airport2 between city2 and city3
    
    ; Vehicles
    (at truck1 loc1)
    (at truck2 airport2)
    (at plane1 airport1)
    
    ; Packages
    (at pkg1 loc1)
    (at pkg2 airport1)
  )
  (:goal (and (at pkg1 loc3) (at pkg2 loc2)))
)

; plan
1. (load pkg1 truck1 loc1)
   deleted: (at pkg1 loc1)
   added: (in pkg1 truck1)
   goals met: 0 of 2
2. (drive truck1 loc1 airport1 city1)
   deleted: (at truck1 loc1)
   added: (at truck1 airport1)
   goals met: 0 of 2
3. (unload pkg1 truck1 airport1)
   deleted: (in pkg1 truck1)
   added: (at pkg1 airport1)
   goals met: 0 of 2
4. (load pkg2 plane1 airport1)
   deleted: (at pkg2 airport1)
   added: (in pkg2 plane1)
   goals met: 0 of 2
5. (load pkg1 plane1 airport1)
   deleted: (at pkg1 airport1)
   added: (in pkg1 plane1)
   goals met: 0 of 2
6. (fly plane1 airport1 airport2)
   deleted: (at plane1 airport1)
   added: (at plane1 airport2)
   goals met: 0 of 2
7. (unload pkg2 plane1 airport2)
   deleted: (in pkg2 plane1)
   added: (at pkg2 airport2)
   goals met: 0 of 2
8. (load pkg2 truck2 airport2)
   deleted: (at pkg2 airport2)
   added: (in pkg2 truck2)
   goals met: 0 of 2
9. (unload pkg1 plane1 airport2)
   deleted: (in pkg1 plane1)
   added: (at pkg1 airport2)
   goals met: 0 of 2
10. (load pkg1 truck2 airport2)
   deleted: (at pkg1 airport2)
   added: (in pkg1 truck2)
   goals met: 0 of 2
11. (drive truck2 airport2 loc2 city2)
   deleted: (at truck2 airport2)
   added: (at truck2 loc2)
   goals met: 0 of 2
12. (unload pkg2 truck2 loc2)
   deleted: (in pkg2 truck2)
   added: (at pkg2 loc2)
   goals met: 1 of 2
13. (drive truck2 loc2 airport2 city2)
   deleted: (at truck2 loc2)
   added: (at truck2 airport2)
   goals met: 1 of 2
14. (drive truck2 airport2 loc3 city3)
   deleted: (at truck2 airport2)
   added: (at truck2 loc3)
   goals met: 1 of 2
15. (unload pkg1 truck2 loc3)
   deleted: (in pkg1 truck2)
   added: (at pkg1 loc3)
   goals met: 2 of 2
